Revit 2024 API
RebarConstraint.ReplaceReferenceTargets Method
 Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones. Will throw exception if this is a constraint for Shape Driven Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public void ReplaceReferenceTargets(
	RebarConstrainedHandle handle,
	IList<Reference> targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
Visual Basic
Public Sub ReplaceReferenceTargets ( _
	handle As RebarConstrainedHandle, _
	targetReferences As IList(Of Reference), _
	isConstraintToCover As Boolean, _
	offsetValue As Double _
)
Visual C++
public:
void ReplaceReferenceTargets(
	RebarConstrainedHandle^ handle,
	IList<Reference^>^ targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
Parameters
handle
Type: Autodesk.Revit.DB.Structure.RebarConstrainedHandle
 The RebarConstrainedHandle that has this constraint.
targetReferences
Type: System.Collections.Generic.IList<Reference>
 The references to which the rebar handle will be constrained. This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover
Type: System.Boolean
 If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue
Type: System.Double
 The distance from references to the rebar handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  handle is no longer valid. -or- targetReferences is empty. -or- targetReferences do not represent faces from structurals that can host rebar.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Constrained rebar is a shape driven rebar element.
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace